import json
import os

#not actual english word

def build_level_based_dataset():
    level_1_standard = [
        ("জবাব", "উত্তর"), ("জলদি", "দ্রুত"), ("খারাপ", "মন্দ"), ("খবর", "সংবাদ"),
        ("শরম", "লজ্জা"), ("খুশি", "আনন্দ"), ("আরাম", "স্বস্তি"), ("সাফ", "পরিষ্কার"),
        ("জরুরি", "আবশ্যক"), ("দেরি", "বিলম্ব"), ("আস্তে", "ধীরে"), ("জায়গা", "স্থান"),
        ("রাস্তা", "পথ"), ("দরজা", "দ্বার"), ("শহর", "নগর"), ("রোজ", "প্রতিদিন"),
        ("গরম", "উষ্ণ"), ("ঠান্ডা", "শীতল"), ("আসল", "প্রকৃত"), ("নকল", "কৃত্রিম"),
        ("ভুল", "ত্রুটি"), ("শুরু", "আরম্ভ"), ("শেষ", "সমাপ্ত"), ("গরিব", "দরিদ্র"),
        ("বন্ধু", "মিত্র"), ("দুশমন", "শত্রু"), ("আওয়াজ", "শব্দ"), ("নাস্তা", "জলখাবার")
    ]

    level_2_formal = [
        ("আদালত", "বিচারালয়"), ("এজলাস", "বিচারাসন"), ("তদন্ত", "অনুসন্ধান"),
        ("ইস্তফা", "পদত্যাগ"), ("বরখাস্ত", "পদচ্যুত"), ("হেফাজত", "রক্ষণাবেক্ষণ"),
        ("জমানত", "আমানত"), ("ফয়সালা", "মীমাংসা"), ("মকদ্দমা", "মামলা"),
        ("তারিখ", "দিনাঙ্ক"), ("জরিমানা", "অর্থদণ্ড"), ("মঞ্জুর", "অনুমোদিত"),
        ("হাজির", "উপস্থিত"), ("ইনসাফ", "ন্যায়বিচার"), ("রায়", "সিদ্ধান্ত"),
        ("হাকিম", "বিচারক"), ("দস্তখত", "স্বাক্ষর"), ("কারাগার", "বন্দিশালা"),
        ("ওকিল", "আইনজীবী"), ("উকিল", "আইনজীবী"), ("মক্কেল", "বিচারপ্রার্থী"),
        ("দোকান", "বিপণি"), ("বাজার", "হাট"), ("কাগজ", "লিখনপত্র")
    ]

    level_3_archaic = [
        ("সাবান", "মলিনানাশক"), ("চশমা", "উপনেত্র"), ("জুতা", "পাদুকা"),
        ("আলমারি", "কাষ্ঠাধার"), ("বালতি", "জলপাত্র"), ("চাবি", "কুঞ্জিকা"),
        ("আনারস", "বহুফল"), ("পাউরুটি", "সেঁকা রুটি"), ("গামলা", "পাত্র"),
        ("তোয়ালে", "অঙ্গমার্জনী"), ("কেরানি", "লিপিকার"), ("কুলি", "ভারবাহক"),
        ("দুনিয়া", "জগৎ"), ("কবর", "সমাধি"), ("লাশ", "মৃতদেহ"), ("চাকু", "কর্তনী")
    ]

    def format_and_sort(word_list):
        formatted = [{"foreign": f, "bangla": b} for f, b in word_list]
        return sorted(formatted, key=lambda x: len(x['foreign']), reverse=True)

    dataset = {
        "level_1": format_and_sort(level_1_standard),
        "level_2": format_and_sort(level_2_formal),
        "level_3": format_and_sort(level_3_archaic)
    }

    base_dir = os.path.dirname(os.path.dirname(os.path.abspath(__file__))) 
    file_path = os.path.join(base_dir, 'bangla_nlp\data', 'foreign_word_to_bangla_word_dataset.json')
    
    os.makedirs(os.path.dirname(file_path), exist_ok=True)
    with open(file_path, 'w', encoding='utf-8') as f:
        json.dump(dataset, f, ensure_ascii=False, indent=4)
    
    print(f"successfully generate: {file_path}")

if __name__ == "__main__":
    build_level_based_dataset()